---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.IsEmpty
source: html/7826035a-a542-00c4-32af-2125df4185c3.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.